# UpdatePIOFromStyle

## Description
Updates the given plugin object from its style, if it has any.

```pascal
PROCEDURE UpdatePIOFromStyle(VAR pioHandle : HANDLE);
```

```python

def vs.UpdatePIOFromStyle():
    return pioHandle
```

## Parameters
|Name|Type|Description|
|---|---|---|
|pioHandle|HANDLE||

## Version
Availability: from Vectorworks 2021
## Category
* Utility